/** ================================================================================================
 * AXT-Studio/Algos.js - algorithms/enum_divisors - main.mjs
 * ------------------------------------------------------------------------------------------------
 * 整数の約数を列挙するアルゴリズムを提供します。
================================================================================================= */

// @ts-check

// ================================================================================================
// 実装本体
// ================================================================================================

/** @type {(n: number) => number[]} - 正の約数列挙。n=1なら[1]、n<1なら[]を返す。 */
const getDivisors = (n) => {
    if (n < 1) return [];
    if (n === 1) return [1];
    /** @type {number[]} */
    const smallDivisors = [];
    /** @type {number[]} */
    const largeDivisors = [];
    const limit = Math.sqrt(n);
    // 1から√nまでの整数で割り切れるかを調べ、割り切れたらiをsmallDivisors、n/iをlargeDivisorsに追加する
    for (let i = 1; i <= limit; i++) {
        if (n % i === 0) {
            smallDivisors.push(i);
            if (i !== n / i) {
                largeDivisors.push(n / i);
            }
        }
    }
    // smallDivisorsにlargeDivisorsの逆順を追加して返す。
    largeDivisors.reverse();
    smallDivisors.push(...largeDivisors);
    return smallDivisors;
};

// ================================================================================================
// ES Module Export
// ================================================================================================

export { getDivisors };
